{
  "system_filters": [
    {
      "name": "Default",
      "description": "This filter won't filter out anything at all.",
      "hidden": [],
      "spoilered": []
    },
    {
      "name": "DSOs",
      "description": "This filter will only show DSO images.",
      "hidden": ["planetary", "solar", "lunar", "aurora-borealis", "terrestrial", "comet", "sattelite", "asteriod", "equipment"],
      "spoilered": []
    }
  ],
  "forums": [
    {
      "name": "General Discussion",
      "short_name": "dis",
      "description": "This is a discussion forum for everything unrelated to astrophotography other forums",
      "access_level": "normal"
    },
    {
      "name": "Equipment Discussion",
      "short_name": "equip",
      "description": "This is a discussion forum for everything related to astrophotography equipment",
      "access_level": "normal"
    },
    {
      "name": "Site and Policy",
      "short_name": "meta",
      "description": "For site discussion and policy discussion",
      "access_level": "normal"
    },
    {
      "name": "Site Assistant Discussion",
      "short_name": "helper",
      "description": "Restricted - Assistants and Staff",
      "access_level": "assistant"
    },
    {
      "name": "Moderation Discussion",
      "short_name": "mod",
      "description": "Restricted - Staff only",
      "access_level": "staff"
    }
  ],
  "users": [{
    "name": "Administrator",
    "email": "admin@example.com",
    "password": "examplepassword",
    "role": "admin"
  }],
  "rating_tags": [
    "dso",
    "planetary",
    "solar",
    "lunar",
    "aurora-borealis",
    "terrestrial",
    "comet",
    "sattelite",
    "asteriod",
    "equipment"
  ],
  "roles": [
    {"name": "moderator", "resource_type": "Image"},
    {"name": "moderator", "resource_type": "DuplicateReport"},
    {"name": "moderator", "resource_type": "Comment"},
    {"name": "moderator", "resource_type": "Tag"},
    {"name": "moderator", "resource_type": "UserLink"},
    {"name": "admin", "resource_type": "Tag"},
    {"name": "moderator", "resource_type": "User"},
    {"name": "admin", "resource_type": "SiteNotice"},
    {"name": "admin", "resource_type": "Badge"},
    {"name": "admin", "resource_type": "Role"},
    {"name": "batch_update", "resource_type": "Tag"},
    {"name": "moderator", "resource_type": "Topic"},
    {"name": "admin", "resource_type": "Advert"},
    {"name": "admin", "resource_type": "StaticPage"}
  ],
  "pages": [
    {
      "title": "Rules",
      "slug": "rules",
      "body": "<div class=\"walloftext\"><div class=\"block block--fixed block--warning\"><div class=\"rule\"><h2 class=\"important\"><a name=\"0\"></a><a href=\"#0\">#0</a>Be excellent to each other</h2><p><strong>This is the most important rule.</strong></p><p>Don’t drag the site down into flamewars and angst – keep it constructive and positive.</p><ul><li>Attempts to antagonize others will not be tolerated.</li><li>Do not troll, attack, insult, name-call, or otherwise try to intentionally antagonize another person or group of people. This includes making racial, sexual, or otherwise demeaning slurs, or posting similarly abusive content.</li><li>Criticism is welcome and encouraged when done so in a constructive and helpful manner. However, using baseless, unconstructive criticism as a veil for the purpose of insulting or attacking an image and/or a photographer is not allowed.</li><li>This rule applies to all images, comments, forum posts, and private messages, along with all other interactions you may make on this website.</li></ul></div></div><div class=\"rule\"><h2><a name=\"1\"></a><a href=\"#1\">#1</a>Respect photographers and their images</h2><p>Astrobooru is a website dedicated to astrophotography. Without the thousands of photographers creating images, we would not have much of a site at all. Therefore, it is important to always respect the wishes of the photographer regarding their images.</p><ul><li>Do not upload edits of someone else's image; by default, it’s expected photographers aren’t okay with changes to their image even if you believe it makes it better.</li><li>Do not upload images from photographers who are on our <a href=\"/dnp\">Do-Not-Post (DNP) List</a>, or who have otherwise publicly made a clear and visible statement that they do not wish for their content to be on this website.</li><li>Do not upload images that contain watermarks or advertisements for sites that promote content theft, sharing of paid-only images, or sharing of images without providing reasonable attribution to the photographers who took them. Likewise, do not share links to such sites either.</li></ul></div><div class=\"rule\"><h2><a name=\"2\"></a><a href=\"#2\">#2</a>Properly tag and source images</h2><p>Without doubt, Astrobooru's most defining feature is our tagging system, which is what organizes the images that have been posted to this website, allowing anyone to find exactly what they are looking for quickly and easily, while filtering out anything they may not want to see. Anyone can edit an image's tags to help organize it better, but it is important to keep tags consistent and accurate.</p><ul><li>All images must have 1 or more <a href=\"/pages/tags\">rating tags</a>.</li><li>If an image is not adequately tagged or sourced, please correct it yourself (when possible, report otherwise) and do <em>not</em> complain in a comment. If someone is consistently tagging/sourcing inadequately, report them.</li><li>If there’s disagreement over tagging/sourcing, defer to staff judgment, and report as necessary.</li><li>For each of an image’s photographers, tag in the format \"photographer:name\". Use \"photographer needed\" if no photographer is known.</li><li>Tags should describe the \"facts\" of an image, like the object, equipment, and the image’s composition. When these are in dispute, the photographer's intent takes precedence. Tags should <em>not</em> be used to state opinions – that’s what comments are for.</li><li>Images originally posted elsewhere should have its URL for source. If the photographer only wants the image on Astrobooru, use the \"Astrobooru Exclusive\" tag.</li><li>Tags should be useful to the site overall. Do not create tags for personal organization, or with very vague or inconsistent definitions.</li><li>Tag and source vandalism will <em>not</em> be tolerated. This includes bulk changes (like removing a tag that's on many images from them all) <em>unless</em> you get permission from staff.</li><li>Images that have rapidly-flashing animation must be tagged with \"seizure warning\".</li></ul></div><div class=\"rule\"><h2><a name=\"3\"></a><a href=\"#3\">#3</a>Do not upload unrelated content</h2><p>This site is intended for astrophotographs. Images that are completely unrelated to astrophotography may be removed.</p><ul><li>Do not upload images without a clear relation to astrophotograhy.</li></ul></div><div class=\"rule\"><h2><a name=\"4\"></a><a href=\"#4\">#4</a>Use filters to hide unwanted content</h2><p>To help you avoid seeing images you may not wish to see, we have a tag filtering system, which allows for hiding of images that contain specific tags.</p><ul><li>If you see images that contain themes you do not like, you should add the appropriate tags to your filter. Do not post comments complaining about the theme of the image.</li><li>If you find an image that you believe violates the site's rules or content guidelines, please report the image so that the site's staff may look into it. Do not post comments claiming an image violates the site's rules.</li></ul></div><div class=\"rule\"><h2><a name=\"5\"></a><a href=\"#5\">#5</a>Do not abuse site functionality (including multiple accounts) or derail discussion</h2><p>Compared to other websites of our size, Astrobooru has a fairly accepting policy in terms of allowing multiple accounts, guest and anonymous posting, and usage of site features. However, this leaves open the possibility of abuse, so certain things are not permitted.</p><ul><li>You are permitted to have multiple accounts for purposes of maintaining different sets of filters or for personal privacy.</li><li>You may not use multiple accounts or anonymous posting for the purposes of evading bans, voting on images multiple times, sockpuppeting, or otherwise appearing to be multiple people within the same conversation.</li><li>Do not spam or put off-topic content in comments/forum posts/reports.</li><li>Do not indiscriminately downvote images based on their tags and/or content. Instead, filter content you do not wish to see.</li><li>If you think someone is violating a rule, submit a report instead of otherwise calling them out (such as with a comment). Don’t submit reports in bad faith, such as frivolous reports to attack others.</li><li>Do not upscale or otherwise manipulate images to artificially create a \"better\" image for duplicate merging.</li><li>You may not post images or image descriptions that are intended to game the site's vote system by offering specific incentives (such as alternative versions of an image) in exchange for upvotes, downvotes, or faves.</li><li>Do not impersonate Astrobooru staff, such as by setting your \"personal title\" or username to anything closely resembling those of a staff member.</li></ul></div><div class=\"rule\"><h2><a name=\"6\"></a><a href=\"#6\">#6</a>Respect privacy</h2><p>Astrobooru takes privacy extremely seriously, and attempting to breach one's privacy is strictly prohibited.</p><ul><li>If you are aware of a photographer or member using multiple names/aliases to keep content separate, or using an alternative name as to not be identified, do not call them out or publicly highlight such a fact.</li><li>Do not share private or personal information about a third party, such as personal contact information, private messages, off site conversations, and other information that they may not want publicly known, without their permission.</li></ul></div><div class=\"rule\"><h2><a name=\"n\"></a><a href=\"#n\">#n</a>Rules are not exhaustive</h2><p>There may always arise situations that were not accounted for in the above rules, or that may be unique or extraordinary in their circumstances. All enforcement of the rules, as well as the decision as to whether something is or is not acceptable, is ultimately left up to the discretion of the site's staff.</p></div></div>"
    },
    {
      "title": "Tag Help",
      "slug": "tags",
      "body": "<div class=\"walloftext\"><div class=\"block block--fixed block--warning\"><h2 class=\"tag-info__heading\">Why Tags Matter</h2><p>Astrobooru has a lot of different types of images, thus, the use of filters to only see that which you want to is essential. Tags are a necessity for filtering to work, and rating tags are the most important because they capture large categorical distinctions of content type.</p></div><h1 class=\"tag-info__heading\">Important Tags</h1><p>These are the most important tags, which you should start out with before considering others.</p><h2 class=\"tag-info__heading\">The rating tags</h2><p>These special tags group content into broad categories. Images require exactly one rating.</p><div class=\"tag-info__category\"><h3 class=\"tag-info__heading\">The dso rating</h3><ul class=\"tag-info__list\"><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">dso</span></h4><p>Images whose main focus is a deep space object (DSO) such as a nebula, star cluster, galaxy, etc.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">planetary</span></h4><p>Images whose main focus is a planet or closely-related object like exo-planets.  </p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">solar</span></h4><p>Images of the sun.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">lunar</span></h4><p>Images of earth's moon.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">aurora-borealis</span></h4><p>Images of the Aurora Borealis, or Northern Lights.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">terrestrial</span></h4><p>Images whose main objective is to highlight a terrestrial object (landscapes, buildings, etc.) while using the night sky as a backdrop.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">comet</span></h4><p>Images of comets.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">sattelite</span></h4><p>Images of man-made sattelites like the ISS.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">asteroid</span></h4><p>Images of asteroids.</p></li><li><h4 class=\"tag-info__heading\"><span class=\"tag\" data-tag-category=\"rating\">equipment</span></h4><p>Images of astrophotography equipment such as telescopes, mounts, cameras, etc.</p></li></ul></div><br><h3 class=\"tag-info__heading\">Other important tags</h3><p><em>You will likely be banned for repeatedly not tagging these, as with ratings.</em></p><ul class=\"tag-info__list\"><li><span class=\"tag\" data-tag-category=\"origin\">photographer:photographer name here</span>— specifies the photographer</li><li><span class=\"tag\" data-tag-category=\"error\">photographer needed</span>— when the photographer is unknown</li><li><span class=\"tag\">seizure warning</span>— rapid animations that could potentially cause seizures</li></ul><p></p><br></div>"
    }
  ]
}
